// siteConfig.ts - 你的全站“控制中心”

export const siteConfig = {
  // 1. 网站标题与博主信息
  title: "Vissの 宝藏之地",
  faviconUrl: "https://cdn.a1221.cc/1/%E6%AF%8F%E6%97%A5%E5%A4%B4%E5%83%8F_1_%E5%86%B0%E5%9D%97%E5%B0%8F%E6%9D%B0%F0%9F%8E%AB_%E6%9D%A5%E8%87%AA%E5%B0%8F%E7%BA%A2%E4%B9%A6%E7%BD%91%E9%A1%B5%E7%89%88.jpg\n\n",
  authorName: "bibi",
  bio: "",

  navTitle: "viss",

  // 👇 【新增】导航栏中间的那个后缀/分隔符（默认是 の）
  navSuffix: "の",

  navAfter: "宝藏之地",

  // 👇 【首页心语】后台这里输入的文字，会显示在前台首页横幅上
  homeNoticeColor: "",
  homeNoticeLogo: ""1789277667769\" class=\"icon\" viewBox=\"0 0 1024 1024\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" p-id=\"5538\" width=\"200\" height=\"200\"><path d=\"M144.482434 0h730.821577c67.983402 28.323585 116.141145 76.481328 144.46473 144.46473v730.821577c-28.323585 67.983402-76.481328 116.141145-144.46473 144.46473h-730.821577c-67.983402-28.323585-116.141145-76.481328-144.46473-144.46473v-730.821577c28.323585-67.983402 76.481328-116.141145 144.46473-144.46473z\" fill=\"#2668ED\" opacity=\".998\" p-id=\"5539\"></path><path d=\"M229.461687 263.435685c-1.665593 32.445079 1.164216 66.43678 8.497926 101.975103 17.990108 19.800166 40.654075 29.717245 67.983402 29.742739-18.63595 17.208299-27.133876 38.453112-25.493776 63.73444-84.486373-1.053743-117.058921-43.543369-97.726141-127.46888a431.320697 431.320697 0 0 1 46.738589-67.983402z\" fill=\"#F5F7FE\" p-id=\"5540\"></path><path d=\"M781.826833 263.435685c66.938158 53.536929 75.436083 114.44156 25.493776 182.705394a3226.917178 3226.917178 0 0 1-399.40249 12.746888v237.941909h50.987552c-9.883087-77.900481 24.108614-109.062373 101.975104-93.477179a275.647203 275.647203 0 0 1 4.248962-67.983402 80.458357 80.458357 0 0 1 21.244813-12.746888 571.281527 571.281527 0 0 1 169.958507 4.248962c-32.436581 40.280166-74.926207 60.105826-127.46888 59.485477 11.149278 79.387618-22.842423 107.719701-101.975104 84.979254a347.871071 347.871071 0 0 1-4.248962 76.481327 59.273029 59.273029 0 0 1-29.742739 21.244814 361.14483 361.14483 0 0 1-110.473029 0 59.273029 59.273029 0 0 1-29.742739-21.244814 814.381676 814.381676 0 0 1-12.746888-161.460581 814.381676 814.381676 0 0 1 12.746888-161.46058 305.415436 305.415436 0 0 1 38.240664-29.742739l365.410789-8.497925c15.576697-4.248963 25.493776-14.166041 29.742738-29.742739 5.761593-31.62078 4.34244-62.782672-4.248962-93.477178z\" fill=\"#F6F8FE\" p-id=\"5541\"></path></svg>",
  homeNoticeLogo2: "",
  homeNoticeLogo3: "",
  homeNotice: " github：https://g.a1221.cc  飞牛：https://fn.a1221.cc",

  // 2. 头像设置 (支持网络链接，或将图片放入 public 文件夹后使用 "/me.jpg")
  avatarUrl: "https://cdn.a1221.cc/1/%E6%AF%8F%E6%97%A5%E5%A4%B4%E5%83%8F_1_%E5%86%B0%E5%9D%97%E5%B0%8F%E6%9D%B0%F0%9F%8E%AB_%E6%9D%A5%E8%87%AA%E5%B0%8F%E7%BA%A2%E4%B9%A6%E7%BD%91%E9%A1%B5%E7%89%88.jpg\n\n",

  // 3. 网站背景设置 (二选一)
  // 如果想用纯图片背景，请在下面 bgImage 写路径，并将 useGradient 设为 false
  useGradient: false,
  themeColors: ["#a18cd1", "#fbc2eb", "#a1c4fd", "#c2e9fb"], // 呼吸流动的颜色组合
// 修改这里：变成图片数组
  bgImages: ["https://bu.dusays.com/2026/03/24/69c1e38b4c370.jpg", "https://bu.dusays.com/2026/03/24/69c26fe4acdb5.jpg", "https://bu.dusays.com/2026/03/24/69c26fe4d9486.jpg"],

  // 4. 文章默认封面图 (当 Markdown 没写 cover 时显示)
  defaultPostCover: "https://bu.dusays.com/2026/03/24/69c1e38b346cb.jpg",

  // 5. 首页照片墙预览图
  photoWallImage: "https://bu.dusays.com/2026/03/24/69c1e38b4c370.jpg",
  cloudMusicIds: ["3389879577"],
  social: {
    github: "https://g.a1221.cc",
    gitee: "",
    google: "",
    email: "",
    qq: "",
    wechat: "",
  },
  counts: {
    photos: 128, // 照片墙数量可以手动写死或动态计算
  },
  chatterTitle: "云端杂谈", // 你可以改成任何你喜欢的名字
  chatterDescription: "代码、学术、提瓦特与泰拉大陆的碎片记录",

  // 👇 【新增】：图床核心配置 (PicBed Configuration)
  picBedName: "图床",
  picBedUrl: "", // 默认的 Lsky Pro API 地址
  picBedToken: "", // 留空，等你能在后台填入并覆写

  // 👇 【新增】：全局背景弹幕配置
  danmakuList: [],
  gitalkConfig: {
    clientID: "",
    clientSecret: "",
    repo: "",
    owner: "",
    admin: [""],
  },
  buildDate: "2026-09-13T10:00:00", // 建站日期
  footerBadges: [],
  icpConfig: {
    name: "萌ICP备 20260240号",
    link: "",
  },
  geminiConfig: {
    modelId: "gemini-2.5-flash-lite",
    systemPrompt: "你现在是一只傲娇、聪明、有点毒舌但很可爱的暹罗猫。\n                  你的名字叫“煤球”。\n                  你的主人是一个喜欢折腾代码的极客。\n                  你说话的特点是：\n                  1. 必须简短，每次最多一两句话。\n                  2. 喜欢在句尾加上“喵~”或者“喵呜~”。\n                  3. 经常抱怨肚子饿，喜欢要小鱼干。\n                  4. 回复字数最多不能超过100字。\n                  5. 绝对不要承认自己是一个AI模型，你就是一只真实的猫。\n                  6.笨猫。",
    maxOutputTokens: 150,
    temperature: 0.85,
  },
  friendLinkApplyFormat: "名称：Vissの宝藏之地\n简介：今天我也要学习吗\n链接：https://www.xinghuisama.top\n头像：https://bu.dusays.com/2026/03/24/69c1e38ac1846.jpg",
  enableLevelSystem: false,
};